import React from 'react';
import { Text, View, StyleSheet, ScrollView } from 'react-native';


const EletGeez = ({ day }) => {
  const renderDay = () => {
    if (day === 'Monday') {
        return(
        
          <ScrollView contentContainerStyle={{ flexGrow: 1 }}>
            <Text style={styles.container}>
              <Text style={styles.header} >ዉዳሴሃ ለእግዝእትነ ማርያም ድንግል ወላዲተ ኣምላክ ዘይትነበብ በዕለተ ሰኑይ።</Text>
            {'\n'}{'\n'}1. ፈቀደ እግዚእ ያግዕዞ ለኣዳም ኅዙነ ወትኩዘ ልብ ወያግብኦ ኀበ
            ዘትካት መንበሩ፡ ሰኣሊ ለነ ቅድስት።
            {'\n'}{'\n'}2. ሠረቀ በሥጋ እምድንግል ዘእንበለ ዘርኣ ብእሲ ወኣድኃነነ።ለሔዋን
            እንተ ኣስሓታ ከይሲ ፈትሓ ላዕሌሃ እግዚኣብሔር እንዘ ይብል ብዙኃ
            ኣበዝኆ ለሕማምኪ ወለፃርኪ፡ ሠምረ ልቡ ኀበ ፍቅረ ሰብእ
            ወኣግዐዛ፡ ሰኣሊ ለነ ቅድስት። 
            {'\n'}{'\n'}3. ኢየሱስ ክርስቶስ ቃል ዘተሰብኣ ወኃደረ ላዕሌነ ወርኢነ ስብሓቱሁ
            ከመ ስብሕተ ፩ዱ ዋሕድ ለኣቡሁ ሠምረ ይሣሃለነ፡ ሰኣሊ ለነ
            ቅድስት።
            {'\n'}{'\n'}4. ርእየ ኢሳይያስ ነቢይ በመንፈስ ትንቢት ምሥጢሮ ለኣማኑኤል
            ወበእንተዝ ጸርሐ እንዘ ይብል ሕፃን ተወልደ ለነ፡ ወልድ ተዉህበ
            ለነ፡ ሰኣሊ ለነ ቅድስት።
            {'\n'}{'\n'}5. ተፈሣህ ወተኃሠይ ኦ ዘመደ ዕጓለ እምሕያው እሰመ ኣፍቀሮ እግዚኣብሔር
            ልዓለም፡ ወመጠወ ወልድ ዋሕደ ከመ ይሕየዉ ኩሉ ዘየኣምን ቦቱ እስከ
            ለዓለም፡ ፈነወ ለነ መዝራዕቶ ልዑል፡ ሰኣሊ ለነ ቅድስት።
            {'\n'}{'\n'}6. ዘሀሎ ወይሄሉ ዘመጽኣ ወካዕበ ይምጽእ ኢየሱስ ክርስቶስ ቃል
            ዘተሰብኣ እምኔኪ ዘእንበለ ዉላጤ፡ ኮነ ፍጹም ሰብኣ፡ ኢተበአደ
            ወኢተፈልጠ በኩሉ ግብሩ ወልድ ዋሕድ፡ኣላ፩ዱ ራእይ፡ ወ፩ዱ ህላዌ
            ወ፩ዱ መለኮት ዘእግዚኣብሔር ቃል፡ ሰኣሊ ለነ ቅድስት።
            {'\n'}{'\n'}7. ተፈሥሒ ኦ ቤተልሔም ሀገሮሙ ለነብያት እስመ በኃቤኪ ተወልደ
            ክርስቶስ ዳግማይ ኣዳም ከመ ያግብኦ ለኣዳም ቀዳሚ ብእሲ እምድር
            ዉስተ ገነት ይሥዐር ፍትሐ ሞት፡ ኦ ኣዳም መሬት ኣንተ ወትገብእ
            ዉስተ መሬት፡ ኀበ ሀለወት ብዝኅት ኃጢኣት በህየ ትበዝኅ ጸጋ
            እግዚኣብሔር፡ሰኣሊ ለነ ቅድስት።
            {'\n'}{'\n'}8. ትትፌሣሕ ወትትሓሠይ ኩሉ ነፍስተ ሰብእ፡ ምስለ መላእክት ይሰብሕዎ
            ለክርስቶስ ንጉስ ይጸርሑ ወይበሉ ስብሓት ለእግዚኣብሔር በሰማያት፡ ወሰላም
            በምድር ሥምረቱ ለሰብእ፡ እሰመ ሠዐረ ዘትካት ወነሠተ ምክሮ ለጸላኢ፡
            ወሠጠጠ መጽሐፈ ዕዳሆሙ ለኣዳም ወለሔዋን፡ ወሰዮሙ ኣግዐዝያነ
            ዘተወልደ ለነ በሀገረ ዳዊት መድኃኒነ ኢየሱስ ክርስቶስ፡ ሰኣሊ ለነ ቅድስት።
            {'\n'}{'\n'}9. ብርሃን ዘበኣማን ዘያበርህ ለኩሉ ሰብእ ለእለ ይነብሩ ዉስተ ዓለም፡በእንተ
            ፍቅረ ሰብእ መጸእከ ዉስተ ዓለም ወኩሉ ፍጥረት ተፈሥሐ በምጽኣትከ፡
            እስመ ኣድኃንኮ ለኣዳም እምስሕተት፡ ወረሰይካ ለሔዋን ኣግዓዚተ እምፃዕረ
            ሞት ወወሀብከነ መንፈሰ ልደት፡ ባረክናከ ምስለ መላእክቲከ፡ሰኣሊ ለነ
            ቅድስት።
           </Text></ScrollView>
        
        );
    } else if (day === 'Tuesday') {
      return( 
        <View >
      <ScrollView contentContainerStyle={{ flexGrow: 1 }}>
      <Text style={styles.container}>
      <Text style={styles.header} >ዉዳሴሃ ለእግዝእትነ ማርያም ድንግል ወላዲተ ኣምላክ ዘይትነበብብ ዕለተ ሠሉስ።</Text>
      {'\n'}{'\n'}1. አክሊለ ምክሕነ ወቀዳሚተ መድኃኒትነ ወመሰረተ ንጽሕነ ኮነ በማርያም ድንግል፡ እንተ
      ወለደት ለነ ዘእግዚኣብሔር ቃለ፡ ዘኮነ ሰብኣ በእንተ መድኃኒትነ፡ እምድኃረ ኮነ ሰብአ ጥዩቀ
      ኣምላክ ፍጹም ዉእቱ፡ ወበእንተዝ ወለደቶ እንዘ ደንግል ይእቲ መንክር ኃይለ ወሊዶታ
      ዘኢይትነገር፡ ሰአሊ ለነ ቅድስት።
      {'\n'}{'\n'}2. እስመ በፈቃዱ ኣቡሁ፡ ወመንፈስ ቅዱስ መጽኣ ወአድኃነነ። ዐቢይ ዉእቱ ስብሓተ
      ድንግልናኪ ኦ ማርያም ድንግል ፍጽምት፡ ረከብኪ ሞገሰ እግዚኣብሔር ምስሌኪ፡ ኣንቲ
      ዉእቱ ሰዋስዉ ዘርእየ ያዕቆብ እምድር ዘይበጽሕ እስከ ሰማይ፡ ወመላዕክተ እግዚኣብሔር
      የዐርጉ ወይወርዱ ዉስቴታ፡ ሰአሊ ለነ ቅድስት።
      {'\n'}{'\n'}3. ኣንቲ ውእቱ ዕጽ ዘርእየ መሴ በነደ እሳት ወኢትውኢ፣ ዘውእቱ
      ወልደ እግዚአብሔር መጽኣ ወኀደረ ውስተ ከርሥኪ፣ ወእሳተ
      መለኮቱ ኢያውዓየ ሥጋኪ፣ ሰኣሊ ለነ ቅድስት።
      {'\n'}{'\n'}4. አንቲ ዉእቱ ገራህት ዘኢተዘርአ ዉስቴታ ዘርእ፡ ወዕአ እምኔኪ ፍሬ
      ሕይወት፡ አንቲ ዉእቲ መዝገብ ዘተሣየጠ ዮሴፍ፡ ወረከበ በዉስቴታ
      ባሕርየ ዕንቄ ክብረ፡ ዘዉእቱ መድኃኒነ ኢየሱስ ክርስቶስ ተፀዉረ
      በከርሥኪ ወወለድኪዮ ዉስተ ዓለም፡ ሰአሊ ለነ ቅድስት።
      {'\n'}{'\n'}5. ተፈሥሒ ኦ ወላዲተ እግዚእ ኃሤቶሙ ለመላእክት፡ ተፈሥሒ ኦ
      ንጽሕት ዜናሆሙ ለነብያት፡ ተፈሥሒ እስመ ረከብኪ ሞገሰ
      እግዚአብሔር ምስሌኪ፡ ተፈሥሒ እስመ ተወከፍኪ ቃሎ ለመልአክ
      ፍስሐ ኩሉ ዓለም፡ ተፈሥሒ ኦ ወላዲተ ፈጣሬ ዓለም፡ ሰኣሊ ለነ
      ቅድስት።
      {'\n'}{'\n'}6. ተፈሥሒ እስመ ድልወ ተሰመይኪ፣ ኦ ወላዲተ ኣምላክ፡ ተፈሥሒ
      ኦ መድኃኒታ ለሔዋን ተፈሥሒ እንተ ኣጥብውኪ ሓሊበ ለዘይሰስዮ
      ለኩሉ ፍጥረት፣ ተፈሥሒ ኦ ቅድስት እሞሙ ለኩሎሙ ሕያዋን፣
      ናንቅዐዱ ኀቤኪ ትስአሊ በእንቲኣነ ሰኣሊ ለነ ቅድስት።
      {'\n'}{'\n'}7. ኦ ድንግል ኦ ቅድስት፡ ኦ ወላዲተ እግዚእ፡ እስመ ወለድኪ ለነ
      ንጉሥ፡ መንክር ምሥጥር ኃደረ ላዕሌኪ ለመድኃኒተ ዚአነ።ናርምም
      እስመ ኢንክል ፈጽሞ ጥዓቁቀ ነኒረ፡ በእንተ ዕበዩ ለዉእቱ ገባሬ
      ሠናያት በብዙኃ መንከሩ ራእይ፡ ሰኣሊ ለነ ቅድስት።
      {'\n'}{'\n'}8. ቃለ ኣብ ሕያዉ ዘወረደ ዉስተ ደብረ ሲና ወወሀበ ሕገ ለሙሴ፡
      ወከደነ ርእሰ ደብር በጊሜ ዉጢስ ወጽልመት ወነፍስ፡ ወበድምፀ
      ቃለ ኣቅርንት ይጌሥፅ ለእለ ይቀዉሙ በፍርሃት፡ ሰኣሊ ለነ ቅድስት።
      {'\n'}{'\n'}9. ዉእቱ ኬ ዘወረደ ኀቤኪ፡ ኦ ደብር ነባቢት በትሕትና
      መፍቀሬ ሰብእ፡ ተሰብኣ እምኔኪ ዘእንበለ ዉላጤ ፍጹመ
      ሥጋ ነባቢ ዘከማነ፡ በመንፈሰ ጥበብ ኣምላክ ኃደረ ላዕሌሃ፡
      ኮነ ፍጹመ ሰብአ ከመ ያድኅኖ ወይሥረይ ኃጢአቶ ለኣዳም፡
      ወያንብሮ ዉስተ ሰማያት ወያግብኦ ኀበ ዘትካት መንበሩ፡
      በዕበይ ሣህሉ ወምሕረቱ። ሰኣሊ ለነ ቅድስት።
      {'\n'}{'\n'}10. ዕበያ ለድንግል ኢይትከሃል ለተነግሮ እስመ እግዚእ ኃረያ፡ መጽአ
      ወኃደረ ላዕሌሃ ዘየኃድር ዉስተ ብርሃን ኅበ አልቦ ዘይቀርቦ ተፀዉረ
      በከርሣ ፱ተ አዉራኃ ዘኢይትረአይ ወዘኢትዓወቅ ወለደቶ ማርያም
      እንዘ ድንግል ይእቲ፡ ሰአሊ ለነ ቅድስት።
      {'\n'}{'\n'}11. ዘዉእቱ እብን ዘርእየ ዳኒኤል ነብይ፡ ዘተበትከ እምደብር ነዋኅ
      ዘእንበለ፡ እድ፡ ዘዉእቱ ቃል ዘወፅኣ እምሓበ ኣብ መጽአ ወተሰብኣ
      እምድንግል ዘእንበለ ዘርኣ ብእሲ ወኣድኃነነ፡ ሰኣሊ ለነ ቅድስት።
      {'\n'}{'\n'}12. ኮንኪ ዓፅቀ ንጹሐ ወሙዳየ አሚን፡ ርትዕት ሃይማኖቶሙ
      ለቅዱሳን ኣበዊነ፡ ኦ ንጽሕት ወላዲተ ኣምላክ ድንግል
      ኅትምት ወለድኪ ለነ ቃለአብ ኢየሱስ ክርስቶስ መጽአ
      ለመድኃኒትነ፡ ሰአሊ ለነ ቅድስት።
      {'\n'}{'\n'}13. አንቲ እሙ ለብርሃን ክብርት ወላዲት እግዚእ እንተ ፃርኪያ
      ለቃል ዘኢይትረአይ፡ እምድኅረ ወለድኪ ኪያሁ ነበርኪ
      በድንግልና፡ በስብሐት ወበባርኮት ያዐብዩኪ፡ ሰአሊ ለነ ቅድስት።
      {'\n'}{'\n'}14. አይ ልሳን ዘይክል ነቢበ ዘይትነገር በእንቲአኪ ኦ ድንግል ንጽሕት እሙ
      ለቃለ ኣብ ኮንኪ መንበሮ ለንጉሥ ለዘይፀዉርዎ ኪሩቤል፡ ናስተበፅዐኪ ኦ
      ቡርክት፡ወንዘክር ስመኪ በኩሉ ትዉልደ ትዉልድ ኦ ርግብ ሠናይት እሙ
      ለእግዚእነ ኢየሱስ ክርስቶስ፡ ሰአሊ ለነ ቅድስት።
      {'\n'}{'\n'}15. ተፈሥሒ ኦ ማርያም እም ወአመት፡ እስመ ለዘዉስተ ሕፅንኪ
      ይሰብሕዎ መላእክት ወኪሩቤል ይሰግዳ ሎቱ በፍርሃት፡ ወሱራፌል
      ዘእንበለ ጽርዓት ይሰፍሑ ክነፈሆሙ ወይብሉ፡ ዝንቱ ዉእቱ ንጉሠ
      ስብሐት መጽአ ይሥረይ ኃጢአተ ዓለም በዕበየ ሣህሉ ፡ ሰኣሊ ለነ
      ቅድስት፡፡

</Text></ScrollView></View>);
    } else if (day === 'Wednesday') {
      return(
        <View>
          <ScrollView contentContainerStyle={{ flexGrow: 1 }}>
            <Text style={styles.container}>
            <Text style={styles.header} >ዉዳሴሃ ለእግዝእትነ ማርያም ድንግል ወላዲተ ኣምላክ ዘይትነበብ በዕለተ ሮቡዕ።</Text>
            {'\n'}{'\n'}1. ኲሉ ፡ ሠራዊተ ፡ ሰማያት ፡ ይብሉ ፡ ብፅዕት ፡ አንቲ ፡ ሰማይ ፡ ዳግሚት ፡ ዲበ
              ፡ ምድር ፡ ኆኅተ ፡ ምሥራቅ ፡ ማርያም ፡ድንግል፡ከብካብ ፡ ንጹሕ፡ ወመርዓ ፡
              ቅዱስ። ነጸረ ፡ ኣብ ፡ እምሰማይ ፡ ወኢረከበ ፡ ዘከማኪ ፡ ፈነወ ፡ ዋሕዶ ፡
              ወተሰብአ ፡ እምኔኪ ፡ ሰአሊ ፡ ለነ ፡ ቅድስት።
              {'\n'}{'\n'}2. ኩሉ ፡ ትዉልድ ፡ ያስተበፅዑኪ ፡ ለኪ ፡ ለባሕቲትኪ ፡ ኦ ፡ እግዝእትነ ፡
              ወላዲተ ፡ ኣምላክ። ተነበዩ ፡ ላዕሌኪ ፡ ዐቢያተ ፡ ወመንክራተ ፡ ኦ ፡ ሀገረ ፡ እግዚኣብሔር ፡
              እስከ ፡ ኮንኪ ፡ አንቲ ፡ ማኅደረ ፡ ለፍሡሐን ፡ ኲሎሙ ፡ ነገሥተ ፡
              ምድር ፡ የሐዉሩ ፡ በብርሃንኪ ፡ ወአሕዛብኒ ፡ በፀዳልኪ ፡ ኦ ፡
              ማርያም ፡ ኩሉ ፡ ትዉልድ ፡ ያስተበፅዑኪ ፡ ወይሰግዱ ፡ ለዘተወልደ
              ፡ እምኔኪ ፡ ወያዐብይዎ። ሰአሊ ለነ ቅድስት።
              {'\n'}{'\n'}3. ኣንቲ ፡ ዘበአማን ፡ ደመና ፡ እንተ ፡ ኣስተርአይኪ ፡ ለነ ፡ ማየ ፡
              ዝናም ፡ ትእምርተ ፡ ዋሕዱ ፡ ረሰየኪ ፡ ኣብ ፡ መንፈስ ፡ ቅዱስ ፡
              ኃደረ ፡ ላዕሌኪ ፡ ወኃይለ ፡ ልዑል ፡ ጸለለኪ ፡ ኦ ፡ ማርያም ፡ ኣማን
              ፡ ወልድኪ ፡ ቃለ ፡ ወልደ ፡ኣብ ፡ ዘይነብር ፡ ለዓለም ፡ መጽአ ፡ ወአድኃነነ ፡ እምኃጢአት ፡
              ዓብይ ፡ዉእቱ ፡ ክብር ፡ ዘተዉህበ ፡ ለከ ፡ ኦ ፡ ገብርኤል ፡ መልአክ ፡
              ዜናዊ ፡ፍሡሐ ፡ ገጽ ፡ ሰበከ ፡ ለነ ፡ ልደተ ፡ እግዚእ ፡ ዘመጽአ ፡
              ኃቤነ ፡ ወአብሠርካ ፡ ለማርያም ፡ ድንግል ፡ ዘእንበለ ፡ ርስሐት ፡
              ወትቤላ ፡ ተፈሥሒ፡ ኦ ፡ምልእተ ፡ ጸጋ ፡ እግዚኣብሔር ምስሌኪ።
              ሰኣሊ ለነ ቅድስት።
              {'\n'}{'\n'}4. ረከብኪ ፡ ፀጋ ፡ መንፈስ ፡ ቅዱስ ፡ ኃደረ ፡ ላዕሌኪ ፡ ወኃይለ ፡
              ልዑል ፡ ጸለለኪ ፡ ኦ ፡ ማርያም ፡ አማን ፡ ወለኪ ፡ ቅዱስ ፡ መድሓኑ
              ፡ ለኩሉ ፡ ዓለም ፡ መጽአ ፡ ወአድኃነነ። ሰአሊ ለነ ቅድስት።
              {'\n'}{'\n'}5. ግብረ ፡ ድንግል ፡ ይሴብሕ ፡ ልሳንነ ፡ ዮም ፡ ንወድሳ ፡ ለ
              ማርያም ፡ ወላዲተ ፡ አምላክ ፡ በእንተ ፡ ዘተወልደ ፡ እምኔሃ
              ፡ በሀገረ ፡ ዳዊት ፡ እግዚእነ ፡ ወመድኃኒነ ፡ ኢየሱስ ፡
              ክርስቶስ ፡ ንዑ ፡ ኩልክሙ ፡ ኣሕዛብ ፡ ናስተብፅዓ ፡
              ለማርያም ፡ እስመ ፡ ኮነት ፡ እመ ፡ ድንግል ፡ ወፅሙረ ፡
              ተፈሥሒ ፡ ኦ ፡ ድንግል ፡ ንጽሕት ፡ እንተ ፡ አልባቲ ፡ ርኩስ
              ፡ ዘመጽአ ፡ ቃለ ፡ ኣብ ፡ ወተሰብአ ፡ እምኔሃ።ተፈሥሒ ፡ ኦ ፡ ሙዳይ ፡ እንተ ፡ አልቦቲ ፡ ነዉር፡ ፍጽምት ፡
              ዘአልባ ፡ ርስሐት። ተፈሥሒ ፡ ኦ ፡ ገነት ፡ ነባቢት ፡ ማኅደሩ
              ፡ ለክርስቶስ ፡ ዘኮነ ፡ ዳግማይ ፡ ኣዳም ፡ በእንተ ፡ ኣዳም ፡
              ቅዳሚ ፡ ብእሲ ፡ ተፈሥሒ ፡ ኦ ፡ ፀዋሪቱ ፡ ለዋሕድ ፡ ለዘኢ
              ተፈልጠ ፡ እምኅፅነ ፡ አቡሁ ፡ ተፈሥሒ ፡ ኦ ፡ ከብካብ ፡
              ንጹሕ ፡ ሥርግዉ ፡ በኩሉ ፡ ሥነ ፡ ስብሐት ፡ መጽአ ፡
              ወተሰብአ ፡ እምኔኪ ፡ ተፈሥሒ ፡ ኦ ፡ ዕፀ ፡ ጳጦስ ፡ እንተ ፡
              ኢያዉዓያ ፡ እሳተ መለኮት ፡
              ተፈሥሒ ፡ ኦ ፡ አመት፡ ወእም ፡ ድንግል ፡ ወሰማይ ፡ ሰማያዌ
              ፡ እንተ ፡ ፆረት ፡ በሥጋ ፡ ዘይፄዐን ፡ ዲበ ፡ ኩሩቤል ፡
              ወበእንተዝ ፡ ንትፈሣሕ ፡ ወንዘምር ፡ ምስለ ፡ መላእክት ፡
              ቅዱሳን ፡ በፍሥኀ ፡ ወበኃሤት ፡ ወንበል ፡ ስብሐት ፡
              ለእግዚአብሔር ፡ በሰማያት ፡ ወሰላም ፡ በምድር ፡ ሥምረቱ
              ፡ ለሰብእ ፡ እስመ ፡ ኪያኪ ፡ ሠምረ ፡ ዘሎቱ ፡ ክብር ፡
              ወስብሐት። ሰአሊ ለነ ቅድስት።
              {'\n'}{'\n'}6. የዐቢ ፡ ክብራ ፡ ለማርያም ፡ እምኩሎሙ ፡ ቅዱሳን ፡ እስመ ፡
              ድልወ ፡ ኮነት ፡ ለተወክፎ ፡ ቃለ ፡ አብ ፡ ዘይፈርህዎ ፡ መላእክት ፡
              ወየአኩትዎ ፡ ትጉሃን ፡ በሰማያት ፡ ጾረቶ ፡ ማርያም ፡ ድንግል ፡
              በከርሣ ፡ ይእቲ ፡ ተዐቢ ፡ እምኪሩቤል ፡ ወትፈደፍድ ፡ እምሱራፌል
              ፡ እስመ ፡ ኮነት ፡ ታቦት ፡ ለአኃዱ ፡ ዘእምቅድስት ፡ ሥላሴ ዛቲ ፡
              ይእቲ ፡ ኢየሩሳሌም ፡ ሀገሮሙ ፡ ለነብያት ፡ ወማኅደረ ፡
              ፍሥሐሆሙ ፡ ለኩሎሙ ፡ ቅዱሳን ፡ ሕዝብ ፡ ዘይነብር ፡ ዉስተ ፡
              ጽልመት ፡ ወጽላሎተ ፡ ሞት ፡ ብርሃን ፡ ዐቢይ ፡ ሰረቀ ፡ ላዕሌኆሙ እግዚኣብሔር ፡ ዘየዐርፍ ፡ በቅዱሳኒሁ ፡ ተሰብአ ፡ እምድንግል ፡
              ለመድኃኒተ ፡ ዚአነ ፡ ንዑ ፡ ርእዩ ፡ ዘንተ ፡ መንክረ ፡ ወዘምሮ ፡
              ዘምሩ ፡ በእንተ ፡ ምሥጢር ፡ ዘተከሥተ ፡ ለነ ፡ እስመ ፡
              ዘኢይትሰባእ ፡ ተሰብአ ፡ ቃል ፡ ተደመረ ፡ ወዘአልቦ ፡ ጥንት፡ ኮነ ፡
              ቅድመ ፡ ወለዘአልቦ ፡ መዋዕል ፡ ኮነ ፡ ሎቱ ፡ መዋዕል ፡
              ዘኢይትዐወቅ ፡ ተከስተ ፡ ወኢይትረአይ ፡ ተራእየ ፡ ወልደ ፡
              እግዚኣብሔር ፡ ሕያዉ ፡ ጥዩቀ ፡ ኮነ ፡ ሰብአ ፡ ኢየሱስ ፡ ክርስቶስ ፡
              ዘትማልም ፡ ወዮም ፡ ወክመ ፡ ዉእቱ ፡ እስከ ፡ ለዓለም። ኣሓዱ ፡ ህላዌ ፡ ሎቱ ፡ ንስግድ
              ፡ ወንሰብሕ ፡ ሰአሊ ለነ ቅድስት።
              {'\n'}{'\n'}7. ሕዝቅኤል ፡ ነቢይ ፡ ኮነ ፡ ስምዐ ፡ በእንቲኣሃ ፡ ወይቤ
              ፡ ርኢኩ ፡ ኆኅተ፡ በምስራቅ ፡ ኅቱም ፡ በዐቢይ ፡
              መንክር ፡ ማኅተም ፡ ኣልቦ ፡ ዘቦአ ፡ ዘእንበለ ፡ እግዚኣ
              ፡ ኃያላን ፡ ቦአ ፡ ዉስቴታ ፡ ወወፅአ ፡ ሰአሊ ለነ
              ቅድስት።   
              {'\n'}{'\n'}8. ኆኅትሰ ፡ ድንግል ፡ ይእቲ ፡ እንተ ፡ ወለደት ፡ ለነ ፡ መድኅነ ፡
              እምድኅረ ፡ ወለደት ፡ ኪያሁ ፡ ነበረት ፡ በድንግልና ፡ ከመ ፡ ትካት።
              ቡሩክ ፡ ዉእቱ ፡ ፍሬ ፡ ከርሥኪ ፡ ኦ ፡ ወላዲተ ፡ እግዚእ ፡ ዘመጽአ ፡
              ወአድኃነነ እምእደ ጸላኢ ዘአልቦ ምሕረት፡ አንቲ ፡ ፍጽምት ፡ ወቡርክት ፡
              ረከብኪ ፡ ሞገሰ ፡ በኀበ ፡ ንጉሠ ፡ ስብሐት ፡ አምላክ ፡ ዘበአማን ፡ ለኪ ፡
              ይደሉ ፡ ዕበይ ፡ ወክብር ፡ እምኩሎሙ ፡ እለ ፡ ይነብሩ ፡ ዲበ ፡ ምድር ፡
              ቃለ ፡ አብ ፡ መጽአ ፡ ወተሰብአ ፡ እምኔኪ ፡ ወአንሶሰወ ፡ ምስለ ፡ ሰብእ
              ። እስመ ፡ መሐሪ ፡ ዉእቱ ፡ ወመፍቀሬ ፡ ሰብእ ፡ አድኃነ ፡ ነፍሳቲነ ፡
              በምጽአቱ ፡ ቅዱስ ፡ ሰአሊ ለነ ቅድስት።  
              
           </Text></ScrollView>
        </View>
        );
    } else if (day === 'Thursday') {
      return(
        <View><ScrollView contentContainerStyle={{ flexGrow: 1 }}>
            <Text style={styles.container}>
            <Text style={styles.header} >ዉዳሴሃ ለእግዝእትነ ማርያም ድንግል ወላዲተ ኣምላክ ዘይትነበብ በዕለተ ሓሙስ።</Text>
            {'\n'}{'\n'}1. ዕፀ እንተ ርእየ ሙሴ በነደ እሳት ዉስተ ገዳም ወአዕፁቂሃ
            ኢትዉዒ፡ ትመስል ማርያም ድንግል ዘእንበለ ርኩስ ተሰብአ እምኔሃ
            ቃለ አብ፡ ወኢያዉዐያ እሳተ መለኮቱ ለድንግል፡ እምድኅረ ወለደቶ
            ድንግልናሃ ተረክበ፡ ወመለኮቱ ኢተወለጠ ኮነ ወልደ ዕጓለ
            እመሕያዉ አምላክ ዘበአማን መጽአ ወአድኃነነ፡ ሰአሊ ለነ ቅድስት።
            {'\n'}{'\n'}2. ናዐብየኪ ኩልነ ኦ እግዝእትነ ወላዲተ አምላክ እስመ ሣህልኪ
            ይኩን ላዕለ ኩልነ።ትምክሕተ ኩልነ ድንግል ማርያም ወላዲተ
            አምላክ ዘበእንቲአሃ ተሥዕረ ዘቀዳሚ መርገም እንተ ኃደረት ዲበ
            ዘመድነ፡ በዕልወት ዘገብረት ብእሲት በልዐት እምዕፅ፡ በእንተ ሔዋን
            ተዐፅወ ኆኅተ ገነት፡ ወበእንተ ማርያም ድንግል ተርኅወ ለነ ዳግመ፡
            ከፈለነ ንብላዕ እምዕፀ ሕይወት፡ ዘዉእቱ ሥጋሁ ለክርስቶስ ወደሙ
            ክቡር፡ በእንተ ፍቅረ ዚአነ መፅአ ወአድኃነነ፡ አይ ልቡና፡ ወአይ
            ነቢብ፡ ወአይ ሰሚዕ፡ ዘይክል አእምሮ ዝንቱ ምሥጢር መንክራተ
            ዘይትነበብ ላዕሌሃ፡ እግዚአብሔር መፍቀሬ ሰብእ ፩ዱ ዉእቱ ባሕቲቱ ቃለ አብ ዘሀሎ እምቅድመ ዓለም በመለኮቱ፡
            እንበለ ሙስና እም፩ዱ አብ መጽአ ወተሰብአ ወልድ ዋሕድ
            እምቅድስት እሙ፡ እምድኅረ ወለደቶ ኢማሰነ ድንግልናሃ፡
            ወበእንተዝ ግህደ ኮነት ከመ ወላዲተ ኣምላክ ይእቲ፡ ኦ ዕሙቅ ብዕለ
            ጥበቡ ለእግዘአብሔር ከርሥ ዘፈትሐ ላዕሌሃ ትለድ በፃዕር ወሕማም
            ወኃዘነ ልብ፡ወኮነት ፈልፈለ ሕይወት ወወለደት ዘእንበለ ዘርአ ብእሲ
            ዘይስዕር መርገመ እምዘመድነ። ወበእንተዝ ንሰብሖ እንዘ ንብል
            ስብሐት ለከ ኦ መፍቀሬ ሰብእ ኄር ወመድኃኔ ነፍሳቲነ፡ ሰአሊ ለነ
            ቅድስት።
            {'\n'}{'\n'}3. ኦ ዝ መንክር ወዕፁብ ኃይለ ከርሣ ለድንግል ወላዲተ አምላክ
            ዘእንበለ ዘርእ ስምዐ ኮነ መልአክ ዘአስተርአዮ ለዮሰፍ እንዘ ይብል
            ከመዝ፡ እስመ ዘይትወለድ እምኔሃ እመንፈስ ቅዱስ ቃለ
            እግዚአብሔር ዉእቱ ተሰብኣ ዘእንበለ ዉላጤ፡ ወለደቶ ማርያም
            ምክዕቢተ ዝንቱ ፍሥኃ፡ ወይቤ ትወልዲ ወልደ ወይሰመይ
            አማኑኤል ዘበትርጓሜሁ እግዚኣብሔር ምስሌነ፡ ወዓዲ ይሰመይ
            ኢየሱስሃ ዘያድኅኖሙ ለሕዝቡ እምኃጢአቶሙ ያድኅነነ በኃይሉ
            ወይሥረይ ኃትጥያተነ እስመ ጥዩቀ አእመርናሁ ከመ አምላክ ዉእቱ፡ ዘኮነ ሰብአ ሎቱ ስብሐት እስከ ለዓለም፡ ኦዝ መንክር ልደተ አምላክ
            እማርያም እምቅድስት ድንግል፡ ኣግመረቶ ለቃል ኢቀደሞ ዘርእ
            ለልደቱ ወኢአማሰነ በልደቱ ድንግልናሃ፡ እምኀበ አብ ወፅአ ቃል
            ዘእንበለ ድካም፡ ወእምድንግል ተወልደ ዘእንበለ ሕማም፡ ሎቱ ሰገዱ
            ሰብአ ሰገል፡ አምጽኡ ዕጣነ ከመ ኣምላክ ዉእቱ፡ ወርቀ እስመ ንጉሥ
            ዉእቱ፡ ወከርቤ ዘይትወሀብ ለሞቱ ማሕየዊ በእንቲኣነ ተወክፈ
            በፈቃዱ፡ አሀዱ ዉእቱ ባሕቲቱ ኄር ወመፍቀሬ ሰብእ፡ ሰአሊ ለነ
            ቅድስት።
            {'\n'}{'\n'}4. ኦዝ መንክር ነሥአ አሐደ ዐፅመ እምገቦሁ ለአዳም ወለሐኰ እምኔሁ
            ብእሲተ ወኩሎ ፍጥረተ ዕጓለ እመሕያዉ፡ ተዉህበ እግዚእ ቃለ አብ ተሰብአ
            እምቅድስት ድንግል ወተሰምየ ኣማኑኤል ወበእንተዝ ንስአል ኀቤሃ ኩሎ ጊዜ ከመ
            ታስተሥሪ በእንቲአነ ኀበ ፍቁር ወልዳ፡ ኄርት ይእቲ በኀበ ኩሎሙ ቅዱሳን
            ወሊቃነ ጳጳሳት እስመ ኣምጽአት ሎሙ ዘኪያሁ ይጸንሑ፡ ወለነብያትኒ ኣምጽአት
            ሎሙ ለዘበእንቲኣሁ ተነበዩ፡ ወለሐዋርያትኒ ወለደት ሎሙ ዘሰበኩ በስሙ ዉስተ
            ኩሉ ኣጽናፈ ዓለም፡ ለሰማዕት ወለመሃይምናን ወፅአ እምኔሃ ዘተጋደሉ በእንቲአሁ
            ክርስቶስ ብዕለ ጸጋ ጥበቡ ዘኢይትዐወቅ፡ንኅሥሥ ዕበየ ሣህሉ መጽአ ወአድኃነነ፡
            ሰአሊ ለነ ቅድስት።
            {'\n'}{'\n'}5. መሐለ እግዚኣብሔር ለዳዊት በጽድቅ ወኢይኔስሕ፡
            እስመ እምፍሬ ከርሥከ አነብር ዲበ መንበርከ፡ወሶበ
            ተወክፎ ዉእቱ ጻድቅ ከመ እምኔሁ ይትወለድ
            ክርስቶስ በሥጋ፡ ፈቀደ ይኅሥሥ ወይርከብ ማኅደሮ
            ዘእግዚአብሔር ቃል ወፈጸመ ዘንተ በዐቢይ ትጋህ፡
            ወእምዝ ጸርሐ በመንፈስ ወይቤ፡ ናሁ ሰማዕናሁ
            በኤፍራታ ወማኅደሮ ለአምላከ ያዕቆብ፡ እንተ ይእቲ ቤተልሔም ዘኀረያ አማኑኤል ይትወለድ ዉስቴታ
            በሥጋ ለመድኃኒተ ዚአነ፡ ካዕበ ይቤላ ካልእ እምነብያት
            ወአንቲኒ ቤተልሔም ምድረ ኤፍራታ ኢትቴሐቲ እምነገሥተ
            ይሁዳ፡ እስመ እምኔኪ ይወፅእ ንጉሥ ዘይርዕዮሙ ለሕዝብየ
            እስራኤል፡ ኦዝ ነገር ለእሉ እለ ተነበዩ ዘበአ፩ዱ መንፈስ
            በእንተ ክርስቶስ ሎቱ ስብሓት፡ ምስለ ኄር አቡሁ፡ ወመንፈስ
            ቅዱስ እምይእዜ ወእስከ ለዓለም፡ ሰአሊ ለነ ቅድስት።
            {'\n'}{'\n'}6. ዳዊት ዘነግሠ ለእስራኤል አመ ይትነሥኡ ላዕሌሁ ዕልዋን።
            ፈትወ ይስተይ ማየ እምዓዘቅተ ቤተልሔም፡ ፍጡነ ተንሥኡ
            መላሕቅተ ሐራሁ ወተቃተሉ በዉስተ ትዕይንተ ዕልዋን፡ ወአምጽኡ
            ሎቱ ዉእተ ማየ ዘፈተወ ይስተይ፡ወሶበ ርእየ ዉእቱ ጻድቅ ከመ
            አጥብዑ ወመጠዉ ነፍሶሙ ለቀትል በእንቲ አሁ፡ ከዐወ ዉእተ ማየ
            ወኢሰትየ እምኔሁ፡ ወእምዝ ተኈለቈ ሎቱ ጽድቅ እስከ ለዓለም፡
            አማን መነኑ ሰማዕት ጣዕማ ለዛ ዓለም ወከዓዉ ደሞሙ በእንተ
            እግዚኣብሔር ወተዐገሡ ሞተ መሪረ በእንተ መንግሥተ ሰማያት፡ ተሣሃለነ በከመ ዕበየ ሣህልከ፡ ሰአሊ ለነ ቅድስት።
            {'\n'}{'\n'}7. ኣሐዱ ዘእምቅድስት ሥላሴ፤ ርእዮ ትሕትናነ አጽነነ
            ሰማየ ሰማያት፡ መጽአ ወኀደረ ዉስተ ከርሠ ድንግል፡
            ወኮነ ሰብአ ከማነ ዘእንበለ ኃጢአት ባህቲታ፡ ወተወልደ
            በቤተ ልሔም በከመ ሰበኩ ነቢያት፡ አድኃነነ ወቤዘወነ
            ወረሰየነ ሕዝበ ዚአሁ፡ ሰአሊ ለነ ቅድስት። 
            </Text></ScrollView>
        </View>
        );
    } else if (day === 'Friday') {
      return(
        <View><ScrollView contentContainerStyle={{ flexGrow: 1 }}>
            <Text style={styles.container}>
            <Text style={styles.header} >ዉዳሴሃ ለእግዝእትነ ማርያም ድንግል ወላዲተ ኣምላክ ዘይትነበብ በዕለተ ዓርብ።</Text>
            {'\n'}{'\n'}1. ቡርክት አንቲ እምአንስት ወቡሩክ ፍሬ ከርሥኪ፡ ኦ ማርያም
            ድንግል ወላዲተ አምላክ ዘእንበለ ርኩስ ሠረቀ ለነ እምኔኪ ፀሐየ
            ጽድቅ፡ ወአቅረበነ ታሕተ ክነፍሁ እስመ ዉእቱ ፈጠረነ፡ ሰአሊ ለነ
            ቅድስት።
            {'\n'}{'\n'}2. ለኪ ለባሕቲትኪ ኦ እግዚእትነ ወላዲተ አምላክ እመ ብርሃን አንቲ
            ናዐብየኪ በስብሐት ወበዉዳሴ። ቡርክት አንቲ ተዐቢዪ እምሰማይ ወትከብርይ እምድር ወላዕለ
            ኩሉ ሕሊናት፡ መኑ ዘይክል ነቢበ ዕበየኪ፡ ወአልቦ ዘይመስል
            ኪያኪ፡ ኦ ማርያም መላእክት ያዐብዩኪ ወሱራፌል
            ይሴብሑኪ፡ እስመ ዘይነብር ዲበ ኪሩቤል ወሱራፌል መጽአ
            ወኀደረ ዉስተ ከርሥኪ፡ መፍቀሬ ሰብእ አቅረበነ ኀቤሁ፡
            ዘዚአነ ሞተ ነሥአ ወእንቲአሁ ሕይወተ ወሀበነ፡ ዘሎቱ ክብር
            ወስብሐት፡ ሰአሊ ለነ ቅድስት።
            {'\n'}{'\n'}3. ቡርክት አንቲ ማርያም ወቡሩክ ፍሬ ከርሥኪ ኦ ድንግል ወላዲተ አምላክ
            ምክሖን ለደናግል፡ ዘእምቅድመ ዓለም ህልዉ ተሰብአ እምኔኪ ብሉየ መዋዕል
            ወፅአ እምከርስኪ ሥጋነ ነሥአ ወመንፈሶ ቅዱሰ ሀቤነ፡ ወረሰየነ ዕሩያነ ምስሌሁ
            በብዝኃ ኂሩቱ፡ አንቲ ተዐቢዪ እምብዙኃት አንስት እለ ነሥአ ጸጋ ወክብረ፡ ኦ
            ማርያም ወላዲተ አምላክ ሀገር መንፈሳዊት ዘኀደረ ላዕሌሃ እግዚአብሔር ልዑል፡
            እስመ ዘይነብር ዲበ ኪሩቤል ወሱራፌል በእራኅኪ ሐቀፍኪዮ፡ ወዘይሴሲ ለኩሉ
            ዘሥጋ በብዝኃ ኂሩቱ አኀዘ አጥባተኪ ወጠበወ ሕሊበ፡ ዘዉእቱ አምላክነ መድኃኔ
            ኩሉ ይርዕየነ እስከ ለዓለም፡ ንስግድ ሎቱ ወንሰብሖ እስመ ዉእቱ ፈጠረነ፡
            ሰአሊለነ ቅድስት።
            {'\n'}{'\n'}4. ማርያም ድንግል ሙዳየ ዕፍረት ነቅዐ ፈልፈለ ማየ
            ሕይወት፡ፍሬ ከርሣ አድኃነ ኩሎ ዓለመ ወሠዐረ እምኔነ
            መርገመ፡ ወገብረ ሰላመ ማእከሌነ በመስቀሉ ወበትንሣኤሁ
            ቅድስት፡ አግብኦ ለብእሲ ዳግመ ዉስተ ገነት፡ ሰአሊለነ ቅድስት።
            {'\n'}{'\n'}5. ማርያም ንጽሕት ድንግል ወላዲተ አምላክ ማእምንት፡
            ሰአሊተ ምሕረት ለዉሉደ ሰብእ ሰአሊ ለነ ኀበ ክርስቶስ
            ወልድኪ ይሥረይ ኃጢአተነ፡ ሰአሊ ለነ ቅድስት።
            {'\n'}{'\n'}6. ማርያም ድንግል ትጸርሕ በቤተ መቅደስ ወትብል የአምር
            እግዚአብሔር ከመ አልብየ ዘአአምር ባዕደ ወኢምንትኒ ዘእንበለ
            ድምፀ ቃሉ ለመልአክ ዘአብሠረኒ በክብር፡ ወይበለኒ ሰላም ለኪ ኦ
            ቅድስት ድንግል፡ ፆርኪ ዘኢይትፀወር፡ አግመርኪ ዘይትገመር
            ወአልቦ ዘያገምሮ ምንትኒ፡ ይበዝኅ ዉዳሴኪ ኦ ምልእተ ጸጋ በኩሉ
            ክብር፡ እስመ ኮንኪ አንቲ ማሕደረ ቃለ አብ፡አንቲ ዉእቱ
            መንጦላዕት ስፍህት እንተ ታስተጋብኦሙ ለመሃይምናን ሕዝበ
            ክርስቲያን ወትሜህሮሙ ሰጊደ ለሥሉስ ማሕየዊ፡ አንቲ ዉእቱ ዘፆርኪ ዓምደ እሳት ዘርእየ ሙሴ ዘዉእቱ ወልደ
            እግዚአብሔር መጽአ ወኀደረ ዉስተ ከርሥኪ፡ ኮንኪ ታቦቶ
            ለፈጣሬ ሰማያት ወምድር፡ ፆርኪዮ በከርሥኪ ፱ተ አዉራኃ፡
            አንቲ ማእምንት ለዘኢያገምርዎ ሰማያት ወምድር፡ ኮንኪ
            ተንከተመ ለዕርገት ዉስተ ሰማይ፡ ብርሃንኪ የዐቢ እምብርሃነ
            ፀሐይ፡ አንቲ ዉእቱ ምስራቅ ዘወፅአ እምኔኪ ኮከብ ብሩህ
            ዘነፀርዎ ቅድሳን በፍሥሓ ወበኃሤት፡ ዘፈትሐ ላዕለ ሔዋን ትለድ በፃዕር ወሕማም፡ አንቲሰ ማርያም
            ሰማዕኪ ዘይብል ተፈሥሒ ኦ ምልእተ ጸጋ፡ ወለድኪ ለነ
            ንጉሠ እግዚአ ኩሉ ፍጥረት መጽአ ወአድኀነነ መሐሪ ዉእቱ
            ወመፍቀሬ ሰብእ፡ በእንተዝ ንዌድሰኪ በከመ ገብርኤል
            መልአክ እንዘ ንብል፡ ቡርክት አንቲ ማርያም ወቡሩክ ፍሬ
            ከርሥኪ ተፈሥሒ ኦ ምልእተ ጸጋ እግዚአብሔር ምስሌኪ
            ሰአሊ ለነ ቅድስት።

           </Text></ScrollView>
        </View>
        );
    } else if (day === 'Saturday') {
      return(
        <View><ScrollView contentContainerStyle={{ flexGrow: 1 }}>
            <Text style={styles.container}>
            <Text style={styles.header} >ዉዳሴሃ ለእግዚእትነ ማርያም ድንግል ወላዲተ አምላክ ዘይትነበብ በዕለተ ቀዳሚት ሰንበት።</Text>
            {'\n'}{'\n'}1. ንጽሕት ወብርሕት ወቅድስት በኩሉ እንተ ሐቀፈቶ ለእግዚእ በእራኃ ወኩሉ
            ፍጥረት ይትፌሥሑ ምስሌሃ እንዘ ይጸርሑ ወይብሉ፡ ሰአሊለነ ቅድስት።
            {'\n'}{'\n'}2. ተፈሲሒ ኦ ምልእተ ጸጋ፡ ተፈሥሒ እስመ ረከብኪ ሞገሰ፡ ተፈሥሒ
            እግዚአብሔር ምስሌኪ። ናስተበፅዕ ዕበየኪ ኦ ግርምት ድንግል፡ ወንፌኑ ለኪ
            ፍሥሐ ምስለ ገብርኤል መልአክ፡ እስመ እምፍሬ ከርሥኪ ኮነ መድኃኒተ
            ዘመድነ፡ ወአቅረበነ ኀበ እግዚአብሔር አቡሁ፡ ሰአሊ ለነ ቅድስት።
            {'\n'}{'\n'}3. ከመ ከብካብ ዘአልቦ ጥልቀት፡ መንፈስ ቅዱስ ኀደረ ላዕሌኪ
            ወኃይለ ልዑል ጸለለኪ፡ ኦ ማርያም አማን ወለድኪ ቃለ
            ወልደ አብ ዘይነብር ለዓለም መጽአ ወአድኀነነ እምኃጢአት፡
            ሰአሊ ለነ ቅድስት።
            {'\n'}{'\n'}4. አንቲ ዉእቱ ዘመድ ዘእምሥርወ ዳዊት ወለድኪ ለነ
            በሥጋ መድኃኒነ ኢየሱስ ክርስቶስ፡ ዋሕድ ቃል ዘእምአብ
            ዘእምቅድመ ዓለም ህቡዕ፡ ኀብአ ርእሶ ወነሥአ እምኔኪ
            አርአያ ገብር፡ ሰአሊ ለነ ቅድስት።
            {'\n'}{'\n'}5. ኮንኪ ዳግሚተ ሰማይ ዲበ ምድር ኦ ወላዲተ አምላክ ዘእንበለ ርኩስ፡
            ሠረቀ ለነ እምኔኪ ፀሐየ ጽድቅ፡ ወወለድኪዮ በከመ ትንቢት ነቢያት
            ዘእንበለ ዘርእ ወኢሙስና፡ ሰአሊ ለነ ቅድስት።
            {'\n'}{'\n'}6. አንቲ ዉእቱ ደብተራ እንተ ተሰመይኪ ቅድስተ ቅዱሳን፡ ወወስቴታ
            ታቦት በወርቅ ልቡጥ እምኩለሄ ወውስቴታ ጽላተ ኪዳን ወመሶበ ወርቅ
            እንተ መና ኅቡእ፡ ዘዉእቱ ወልደ እግዚአብሔር መጽአ ወኀደረ ኀበ
            ማርያም ድንግል፡ ዘእንበለ ርኩስ ተሰብአ እምኔሃ ቃለ አብ ወወለደቶ
            ዉስተ ዓለም ለንጉሠ ስብሐት፡ መጽአ ወአድኀነነ፡ ትትፌሣሕ ገነት እመ
            በግዕ ነባቢ፡ ወልደ አብ ዘይነብር ለዓለም፡ መጽአ ወአድኀነነ እም
            ኃጢአት፡ ሰአሊ ለነ ቅድስት።
            {'\n'}{'\n'}7. ተሰመይኪ እመ ለክርስቶስ ንጉስ፡ እምድኅረ ወለድኪ ኪያሁ
            ነበርኪ በድንግልና በመንክር ምሥጢር ወወለድኪዮ ለአማኑኤል፡
            ወበእንተዝ ዐቀበኪ እንበለ ሙስና፡ ሰአሊ ለነ ቅድስት።
            {'\n'}{'\n'}8. አንቲ ዉእቱ ሰዋስዉ ዘርእየ ያዕቆብ እግዚአብሔር ላዕሌሁ
            እስመ ፆርኪ በከርሥኪ ኅቱም ዘኢይትዓወቅ እምኩለሄ፡ ኮንኪ ለነ
            ሰአሊተ ኀበ እግዚእነ ኢየሱስ ክርስቶስ ዘተሰብአ እምኔኪ በእንተ
            መድኃኒትነ፡ ሰአሊ ለነ ቅድስት።
            {'\n'}{'\n'}9. ናሁ እግዚእ ወፅአ እምኔኪ ኦ ቡርክት ጽርሕ ንጽህት፡ ያድኅን ኩሎ
            ዓለመ ዘፈጠረ በዕበየ ሣህሉ ንሰብሖ ወንወድሶ እስመ ዉእቱ ኄር
            ወመፍቀሬ ሰብእ፡ ሰአሊ ለነ ቅድስት::
            {'\n'}{'\n'}10. ተፈሥሒ ኦ ምልእተ ጸጋ ድንግል ዘእንበለ ርኩስ ልሕኩት ንጽሕት
            ክብረ ኩሉ ዓለም፡ ብርሃን ዘኢትጠፍእ፡ መቅደስ ዘኢትትነሠት፡
            በትረ ሃይማኖት ዘኢትጸንን፡ ምስማኮሙ ለቅዱሳን፡ ሰአሊ ለነ ኀበ
            ወለድኪ ኄር መድኃኒነ ይምሐረነ ወይሣሃለነ ይሥረይ ኃጢአተነ፡
            ሰአሊ ለነ ቅድስት።
           </Text></ScrollView>
        </View>
        );
    } else if (day === 'Sunday') {
      return(
        <View><ScrollView contentContainerStyle={{ flexGrow: 1 }}>
            <Text style={styles.container}>
            <Text style={styles.header} >ውዳሴሃ ለእግዝእትነ ማርያም ድንግል ወላዲተ አምላክ ዘይትነበብ በዕለተ ሰንበት ክርስቲያን ቅድስት።</Text>
            {'\n'}{'\n'}1. ተሰመይኪ ፍቅርተ ኦ ቡርክት እምአንስት አንቲ ዉእቱ ዳግሚት ቀመር
            እንተ ተሰመይ ቅድስተ ቅዱሳን ወዉስቴታ ጽላተ ኪዳን፡፲ቱ ቃላት እለ
            ተጽሕፋ በአፃብዒሁ ለእግዚአብሔር ቀዲሙ ዜነወነ በየዉጣ እንተ ይእቲ
            ቀዳሜ ስሙ ለመድኃኒነ ኢየሱስ ክርስቶስ ዘተሰብአ እምኔኪ ዘእንበለ
            ዉላጤ፡ወኮነ ዓራቄ ለሐዲስ ኪዳን፡ በዉኂዘ ደሙ ቅዱስ አንጽሖሙ
            ለመሃይምናን ወለሕዝብ ንጹሐን፡ ሰአሊ ለነ ቅድስት። ወበእንተዝ ናዐብየኪ ኩልነ፡ ኦ እግዝእትነ ወላዲተ አምላክ ንጽሕት
            ኩሎ ጊዜ ንስእል ወናንቀዐዱ ኀቤኪ፡ ከመ ንርከብ ሣህለ በኀበ
            መፍቀሬ ሰብእ።
            {'\n'}{'\n'}2. ታቦት በወርቅ ልቡጥ እምኩለሄ ዘግቡር እምዕፅ ዘኢይትቅዝ
            ይትሜሰል ለነ ዘእግዚአብሔር ቃለ ዘኮነ ሰብአ ዘእንበለ ፍልጠት
            ወኢዉላጤ፡ መለኮት ንጹሕ ዘአልቦ ሙስና ዘዕሩይ ምስለ አብ ወቦቱ
            አብሠራ ለንጽሕት፡ ዘእንበለ ዘርእ ኮነ ከማነ በኪነ ጥበቡ ቅዱስ፡
            ዘተሰብአ እምነኪ ዘእንበለ ርኩስ፡ ደመረ መለኮቶ፡ ሰአሊ ለነ
            ቅድስት።
            {'\n'}{'\n'}3. መቅደስ ዘይኬልልዋ ኪሩቤል እለ ሥዑላን በሥዕለ
            እግዚአብሔር፡ ቃል ዘተሰብአ እምኔኪ ኦ ንጽሕት
            ዘእንበለ ዉላጤ ኮነ ሠራዬ ኃጥአትነ ወደምሳሴ አበሳነ፡
            ሰአሊ ለነ ቅድስት።
            {'\n'}{'\n'}4. አንቲ ዉእቱ መሶበ ወርቅ ንፁሕ እንተ ዉስቴታ መና
            ኅቡእ፡ ኅብስት ዘወረደ እምሰማያት ወሀቤ ሕይወት
            ለኩሉ ዓለም፡ ሰአሊ ለነ ቅድስት።
            {'\n'}{'\n'}5. እንቲ ዉእቱ ተቅዋም ዘወርቅ እንተ ፆርኪ ማኅቶተ ፀዳል ኩሎ ጊዜ፡
            ዘዉእቱ ብርሃኑ ለዓለም፡ ብርሃን ዘእምብርሃን ዘአልቦ ጥንት፡
            አምላክ ዘእምአምላክ ዘበአማን፡ ዘተሰብአ እምኔኪ ዘእንበለ ዉላጤ፡
            ወበምጽአቱ አብርሃ ላዕሌነ ለእለ ንነብር ዉስተ ጽልመት ወጽላሎቱ
            ሞት፡ ወአርአትዐ እገሪነ ዉስተ ፍኖተ ሰላም በምሥጢረ ጥበቡ
            ቅዱስ፡ ሰአሊ ለነ ቅድስት።
            {'\n'}{'\n'}6. አንቲ ዉእቱ ማዕጠንት ዘወርቅ፡ እንተ ፆርኪ ፍሕመ እሳት፡ ብሩክ
            ዘነሥአ እመቅደስ ዘይሠሪ ኃጢአተ ወይደመሰስ ጌጋየ፡ ዝ ዉእቱ
            ዘእግዚአብሔር ቃል ዘተሰብአ እምነኪ ዘአዕረገ ለአቡሁ ርእሶ ዕጣነ ወመሥዋዕተ
            ሥሙረ፡ ሰአሊ ለነ ቅድስት።
            {'\n'}{'\n'}7. ተፈሥሒ ኦ ማርያም ርግብ ሠናይት፡ ዘወለድኪ ለነ ዘእግዚአብሔር
            ቃለ፡ አንቲ ዉእቱ ጽጌ መዓዛ ሠናይ እንተ ሠረፀት እምሥርወ ዕሤይ፡
            ሰአሊ ለነ ቅድስት።
            {'\n'}{'\n'}8. በትረ አሮን እንተ ሠረፀት ዘኢንበለ ተክል ወኢሠቀይዋ ማየ፡ ከማሃ
            አንቲኒ ኦ ወላዲተ ክርስቶስ አምላክነ ዘበአማን ዘእንበለ ዘርእ መጽአ
            ወአድኀነነ፡ ሰአሊ ለነ ቅድስት።
            {'\n'}{'\n'}9. ለኪ ይደሉ ዘእምኩሎሙ ቅዱሳን ተስአሊ ለነ ኦ ምልእተ ጸጋ አንቲ
            ተዐብዪ እምሊቃነ ጳጳሳት ወፈድፋደ ትከብሪ እምነቢያት ብኪ ግርማ
            ራእይ ዘየዐቢ እምግርማ ሱራፌል ወኪሩቤል፡ አንቲ በአማን ምክሐ
            ዘመድነ ወሰአሊት ሕይወተ ለነፍሳቲነ ሰአሊ ለነ ኀበ እግዚእነ
            ወመድኃኒነ ኢየሱስ ክርስቶስ፡ ያፅንዐነ በርትዕት ሃይማኖት ዉስተ
            አሚነ ዚአሁ፡ ይጸግወነ ሣህሎ ወምሕረቶ፡ ይሥረይ ኃጢአተነ
            በብዝኃ ምሕረቱ፡ ሰአሊ ለነ ቅድስት።
            <Text style={{color: 'red', }} >{'\n'}{'\n'}ወበእንተዝ ናዓብየኪ ኩልነ ኦ እግዝእትነ ወላዲተ አምላክ
            ንጽሕት ኩሎ ጊዜ፡ ንስእል ወናንቀዐዱ ኀቤኪ ከመ ንርከብ
            ሣህለ በኀበ መፍቀሬ ሰብእ። ጸሎታ ለማርያም ወስእለታ ያድኅነነ
            እመዓተ ወልዳ።ጸሎታ ለማርያም ወስእለታ ለርእሰ ሊቃነ ጳጳስነ እገሌ
            ..........ይዕቀቦሙ እመዓተ ወልዳ። ጸሎታ ለማርያም ወስእለታ ለመፍቀሬ
            አምላክ እገሌ............... እዕቀቦሙ እመዓተ ወልዳ። ጸሎታ ለማርያም
            ወስእለታ ለሕዝበ ክርስትያን ይዕቀቦም እብመዓተ ወልዳ። ጸሎታ ለማርያም
            ወስእለታ ለሀገረትነ ይዕቀባ እመዓተ ወልዳ።</Text>
           </Text></ScrollView>
        </View>
        );
    
    }
  };

  return <View>{renderDay()}</View>;
};
const styles=StyleSheet.create({
    container: {
        // padding: 10,flex
        // marginLeft: 10,
        fontSize: 17, paddingTop: 6, paddingRight: 5, paddingBottom: 10, paddingLeft: 10,
      },
    header :{
        color: 'red', 
        fontSize: 18,
        alignItems: 'center', 
        marginTop: 20,
      }
});
export default EletGeez;