import React from 'react'
import { Text, StyleSheet, ScrollView } from 'react-native';
const የዘወትር_ጸሎት = () => {
  return (
    <ScrollView contentContainerStyle={{ flexGrow: 1 }}>
            <Text style={styles.container}>
              <Text style={styles.header} >ጸሎት ዘዘወትር</Text>
                {'\n'}{'\n'}1. አዐትብ ገጽየ ወኩለንታየ በትእምርተ መስቀል። በስመ
                ኣብ ወወልድ ወመንፈስ ቅዱስ ኣሓዱ ኣምላክ።
                በስመ አብ ወወልድ ወመንፈስ ቅዱስ አሓዱ አምላክ 
                በቅድስት ሥላሴ እንዘ አአምን ወእትመኅፀን እክሕደከ
                ሰይጣን በቅድመ ዛቲ እምየ ቅድስት ቤተ ክርስትያን
                እንተ ይእቲ ስምዕየ ማርያም ጽዮን ለዓለም ዓለም።
                
                {'\n'}{'\n'}2. ነኣኩተከ እግዚኦ ወንሴብሐከ። ንባርከከ እግዚኦ ወንትኣመነከ
                ንገኒ ለከ እግዚኦ ወንትቀነይ ለስምከ ቅዱስ። ንሰግድ ለከ ኦ
                ዘለከ ይሰግድ ኩሉ ብርክ ወለከ ይትቀነይ ኩሉ ልሳን። ኣንተ
                ዉእቱ ኣምላከ ኣማልክት፡ ወእግዚኣ ኣጋእዝት፡ ወንጉሠ
                ነገሥት፡ ኣምላክ ኣንተ ለኩሉ ዘሥጋ ወለኩሉ ዘነፍስ፡
                ወንጼዉዓከ በከመ መሐረነ ቅዱስ ወልድከ እንዘ ይብል
                ኣንትሙሰ ሶበ ትጼልዩ ከመዝ በሉ። 

                {'\n'}{'\n'}3. ኣቡነ ዘበሰማያት ይትቀደስ ስምከ፤ትምጻእ መንግሥትከ
                ወይኩን ፈቃድከ በከመ በሰማይ ከማሁ በምድር ፡ ሲሳየነ
                ዘለለ ዕለትነ ሀበነ ዮም። ኅድግ ለነ ኣበሳነ ወጌጋየነ ከመ
                ንሕነኒ ንኅድግ ለዘኣበሰለነ። ኢታብኣነ እግዚኦ ውስተ
                መንሱት። ኣላ ኣድኅነነ ወባልሐነ እምኩሉ እኩይ ፡፡እስመ
                ዚአከ ይእቲ መንግሥት ኃይል ወስብሐት ለዓለመ ዓለም።
                ኣሜን

                {'\n'}{'\n'}4. በሰላም ቅዱስ ገብርኤል መልአክ ኦ እግዝእትየ ማርያም
                ሰላም ለኪ። ድንግል በሕሊናኪ ወድንግል በሥጋኪ እመ
                እግዚአብሔር ጸባዖት ሰላም ለኪ፡ ቡርክት አንቲ እምአንስት
                ወቡሩክ ፍሬ ከርሥኪ። ተፈሥሒ ፍሥሕት ኦ ምልእተ ጸጋ
                እግዚአብሔር ምስሌኪ፡ ሰአሊ ወጸልዩ ለነ ኀበ ፍቁር
                ወልድኪ ኢየሱስ ክርስቶስ ከመ ይሥረይ ለነ ኃጣዉኢነ።
                ኣሜን

                {'\n'}{'\n'}5. ጸሎተ ሃይማኖት ነአምን በ፩ዱ ኣምላክ እግዚኣብሔር ኣብ ኣኃዜ ኩሉ
                ዓለም ገባረ ሰማያት ወምድር ዘኢያስተርኢ ወዘኢያስተርኢ። ወነኣምን
                በ፩ዱ እግዚእ ኢየሱስ ክርስቶስ ወልደ ኣብ ዋሕድ ዘህልው ምስሌሁ
                እምቅድመ ይትፈጠር ዓለም። ብርሃን ዘእምብርሃን ኣምላክ ዘእምኣምላክ
                ዘበኣማን። ዘተወልደ ወኣኮ ዘተገብረ ዘዕሩይ ምስለ ኣብ በመለኮቱ። ዘቦቱ
                ኩሉ ኮነ ወዘእንበሌሁሰ ኣልቦ ዘኮነ ወኢምንትኒ ዘበሰማይኒ
                ወዘበምድርኒ።ዘበእንቲኣነ ለሰብእ ወበእንተ መድኃኒትነ ወረደ
                እምሰማያት። ተስብኣ ወተሠገወ ወእመንፈስ ቅዱስ ወእማርያም እምቅድስት ድንግል። ኮነ
                ብእሲ ወተሰቅለ በእንቲኣነ በመዋዕለ ጵላጦስ ጴንጤናዊ ሓመ ወሞተ
                ወተቀብረ ወተንሥአ እሙታን ኣመ ሣልስት ዕለት በከመ ጽሑፍ ዉስተ
                ቅዱሳት መጻሕፍት። ዐርገ በስብሓት ዉስተ ሰማያት ወነበረ በየማነ
                ኣቡሁ፡ ዳግመ ይመጽእ በስብሓት ይኮንን ሕያዋነ ወሙታነ ወኣልቦ
                ማኅለቅት ለመንጉሥቱ። ወነኣምን በመንፈስ ቅዱስ እግዚእ ማሕየዊ
                ዘሰረፀ እምአብ ንስግድ ሎቱ ወንሰብሖ ምስለ ኣብ ወወልድ ዘነበበ
                በነቢያት። ወነኣምን በኣሐቲ ቅድስት ቤተ ክርስቲያን እንተ ላዕለ ኩሉ
                ጉባኤ ዘሐዋሪያት፡ ወነኣምን በኣሓቲ ጥምቀት ለሥርየተ ኃጢኣት።
                ወንሴፎ ትንሣኤ ሙታን ወሕይወተ ዘይመጽእ ለዓለመ ዓለም።

                {'\n'}{'\n'}6. ቅዱስ ቅዱስ ቅዱስ እግዚኣብሔር ጸባዖት ፍጹም ምሉእ ሰማያተ ወምድረ
                ቅድሳተ ስብሓቲከ። ንሰግድ ለከ ክርስቶስ ምስለ ኣቡከ ኄር ሰማያዊ
                ወመንፈስከ ቅዱስ ማሕየዊ እስመ መጻእከ ወኣድኃንከነ።

                {'\n'}{'\n'}7. እሰግድ ለኣብ ወወልድ ወመንፈስ ቅዱስ አሐተ ስግደተ እሰግድ ለኣብ
                ወወልድ ወመንፈስ ቅዱስ ኣሓተ ስግደተ እሰግድ ለኣብ ወወልድ
                ወመንፈስ ቅዱስ ኣሓተ ስግደተ
                እንዘ ኣሓዱ ሠለስቱ ወእንዘ ሠለስቱ ኣሓዱ ይሤለሱ በኣካላት
                ወይትወሓዱ በመለኮት እሰግድ ለእግዝእትነ ማርያም ድንግል
                ወላዲተ ኣምላክ እሰግድ ለመስቀለ እግዚእነ ኢየሱስ ክርስቶስ
                ዘተቀደሰ በደሙ ክቡር መስቀል ኃይልነ መስቀል ጽንዕነ
                መስቀል ቤዛነ መስቀል መድሃኒተ ነፍስነ። ኣይሁድ ክሕዱ።
                ንሕነሰ ኣመነ ወእለ ኣመነ በኃይለ መስቀሉ ድኅነ። 
                {'\n'}{'\n'}8. ስብሓት ለኣብ ስብሓት ለወልድ ስብሓት ለመንፈስ ቅዱስ /3/ ፤
                ስብሓት ለእግዝእትነ ማርያም ድንግል ወላዲተ ኣምላክ ፤ ስብሓት
                ለመስቀለ እግዚእነ ኢየሱስ ክርስቶስ ፤ ክርስቶስ በምሕረቱ ይዘክረነ ፤
                ኣመ ዳግም ምጽኣቱ ኢያስተኃፈረነ ፤ ለሰብሖተ ስሙ ያንቅሓነ ፤
                ወበኣምልኮቱ ያጽንኣነ ፤ እግዝእትነ ማርያም ድንግል ወላዲተ ኣምላክ
                ኣእርጊ ጸሎትነ ፤ ወኣስተስርዪ ኩሎ ሃጢኣተነ ፤ ቅድመ መንበሩ
                ለእግዚእነ ፤ ለዘኣብልኣነ ዘንተ ኅብስተ ፤ ወለአስተየነ ዘንተ ጽዋዐ ፤ ወለዘሠርዐ ለነ
                ሲሳየነ ወዐራዘነ ፤ ወለዘተዓገሰ ለነ ኩሎ ኃጢኣተነ ፤ ወለዘወሀበነ
                ሥጋሁ ቅዱሰ ወደሞ ክቡረ ፤ ወለዘአብጽሓነ እስከ ዛቲ ሰዓት፡፡ ነሀብ
                ሎቱ ስብሓተ ውኣኰቴተ ለእግዚኣብሔር ልዑል ወለወላዲቱ ድንግል
                ወለመስቀሉ ክቡር ይትኣኰት ወይሰባሕ ስሙ ለእዚኣብሔር
                ኣምላክነ ወትረ በክሉ ጊዜ ወበኩሉ ሰዓት፡፡ ሀሌ ሉያ ሰብሕዎ
                ወወድስዎ በአሐቲ ቃል ሣራረሀ ኩሉ ዓለም ። 
                {'\n'}{'\n'}9. ሰላም ለኪ እንዘ ንሰግድ ንብለኪ ማርያም እምነ ናስተበቁዐኪ። እምኣርዌ
                ነኣዊ ተማኅጸነ ብኪ። በእንተ ሓና ኢምኪ ወኢያቄም ኣቡኪ ማኅበረነ ዮም
                ድንግል ባርኪ።

                {'\n'}{'\n'}10. ጸሎተ እግዝእትነ ማርያም ድንግል ወላዲተ ኣምላክ። ታዐብዮ ነፍስየ
                ለእግዚኣብሔር። ወትትኃሠይ መንፈስየ በኣምላኪየ ወመድኃንየ፤ እስመ ርእየ
                ሕማማ ለኣመቱ። ናሁ እምይእዜሰ ያስተበፅዑኒ ኩሉ ትዉልድ።
                እስመ ገብረ ሊተ ኃይለ ዐቢያተ ወቅዱስ ስሙ። ወሣህሉኒ ለትውልደ ትዉልድ ለእለ
                ይፈርህዎ። ወገብረ ኃይለ በመዝራዕቱ፡ ወዘረዎሙ ለእለ ያዐብዩ ሕሊና ልቦሙ፡
                ወነሠቶሙ ለኃያላን እመ ናብርቲሆሙ። ኣዕበዮሙ ለትሑታን፡ ወኣጽገቦምሙ
                እምበረከቱ ለርኁባን፡ ወፈነዎሙ ዕራቆሙ ለብዑላን ወተወክፎ ለእስራኤል
                ቍልዔሁ፡ ወተዘከረ ሣህሎ ዘይቤሎሙ ለኣበዊነ ለኣብርሃም ወለዘርኡ እስከ
                ለዓለም። ሉቃስ ፩፡፵፮-፶፭። ስብሓት ለኣብ ወወልድ ወመንፈስ ቅዱስ፡ ለዓለም
                ወለዓለመ ዓለም ኣሜን።

                {'\n'}{'\n'}<Text style={styles.header} >ኦ እግዚእትየ ፍትኅኒ እማይሰሩ ለሰይጣን እሙ ለመድኅን
                ወለተ ብርሃን ባርኪኒ ቀድስኒ ወአንፅኅኒ በከመ ባርክዮ
                ለቅዱስ ኤፍሬም ፍቁርኪ በረከተ ፍቁር ወልድኪ ወአቡሁ
                ወመንፈስ ቅዱስ ይኅድር በላዕሌየ ።</Text>
           </Text></ScrollView>
        
        );
  
}
const styles=StyleSheet.create({
    container: {
        // padding: 10,flex
        // marginLeft: 10,
        fontSize: 17, paddingTop: 6, paddingRight: 5, paddingBottom: 10, paddingLeft: 10,
      },
    header :{
        color: 'red', 
        fontSize: 18,
        alignItems: 'center', 
        marginTop: 20,
      }
});
export default የዘወትር_ጸሎት