import React from 'react'
import { StyleSheet, Text, ScrollView } from 'react-native'
const ይወድስዋ_መላዕክት = () => {
  return (
    <ScrollView contentContainerStyle={{ flexGrow: 1 }}>
            <Text style={styles.container}>
              <Text style={styles.header} >† ይወድስዋ መላዕክት</Text>
              {'\n'}{'\n'}1. ይዌድስዋ መላእክት ለማርያም በዉስተ ዉሥጤ መንጦላዕት፡ ወይበልዋ
                በሐኪ ማርያም ሐዳስዩ ጣዕዋ። ይቤላ መልአክ ለማርያም ተወከፈዮ
                ለቃል ኅቤኪ ይመጽእ ወበማኅፀነ ዚአኪ የኅድር፡ እፎ ቤተ ነዳይ ኅደረ
                ከመ ምስኪን እምሰማያት ወረደ ላዕሌሃ ፈቲዎ ሥነ ዚአሃ ወተወልደ
                እምኔሃ።
                {'\n'}{'\n'}2. ወበሳድስ ወርኅ ተፈነወ ገብርኤል መልአክ እምኅበ እግዚአብሔር ኀበ
                አሐቲ ሀገር ዘገሊላ እንተ ስማ ናዝሬት ኀበ ድንግል እንተ ተፍኅረት
                ለብእሲ ዘስሙ ዮስፍ ዘእምቤተ ዳዊት፡ ወስማ ለይእቲ ድንግል ማርያም፡
                ቦአ መልአክ ኀቤሃ ወይቤላ ተፈሥሒ ፍሥሕት ኦ ምልእተ ጸጋ
                እግዚአብሔር ምስሌኪ፡ ብርክት አንቲ እምአንስት ወርእያ ደንገፀት
                እምቃሉ ወሐለየት ወትቤ፡ እፎኑ ከመዝኑ እንጋ አምኃ ይትአምኁ ወይበላ
                መልአክ ኢትፍርሂ እስመ ረከብኪ ሞገሰ በኀበ እግዚአብሔር ወናሁ
                ትፀንሲ ወትወልዲ ወልደ ወትሰምዪዮ ስሞ ኢየሱስ ዉእቱ ዐቢይ
                ወይትሰመይ ወልደ እግዚአብሔር ልዑል። ወይሁቦ እግዚአብሔር አምላክ መንበረ ዳዊት አቡሁ።ወይነግሥ
                ለቤተ ያዕቆብ ለዓለም ወአልቦ ማኅለቅት ለመንግስቱ፡ ትቤሎ
                ማርያም ለመልአክ እፎኑ ይከዉነኒ ዝንቱ እንዘ ኢየአምር ብእሴ
                እፎኑ ይከዉነኒ አዉሥኣ መልአክ ወይቤላ መንፈሰ እግዚአብሔር
                ቅዱስ ይመጽእ ላዕሌኪ ወኃይለ ልዑል ይጸልለኪ ዘኒ ይትወለድ
                እምኔኪ ቅዱስ ዉእቱ ወይሰመይ ወልደ እግዚአብሔር ልዑል፡ ወናሁ
                ኤልሳቤጥኒ እንተ እምአዝማድኪ ይእቲኒ ፀንሰት ወረክበት ወልደ
                በልኅቃቲሃ ወበርሥኣቲሃ ፡ ወናሁ ሳድስ ዝንቱ ወርኅ ለእንተ ይብልዋ መካን እስመ አልቦ ነገር ዘይሰአኖ
                ለእግዚአብሔር፡ ትቤሎ ማርያም ለመልአክ ነየ አመቱ ለእግዚአ ኩሉ ነየ
                አመቱ።ይኩነኒ በከመ ትቤለኒ።ይቤላ መልአክ ሰላም ለኪ፡ ይቤላ ገብርኤል ሰላም ለኪ፡
                ማርያም ድንግል ሰላም ለኪ፡ ወላዲተ አምላክ ሰላም ለኪ፡
                ማርያም ቅድስት ሰላም ለኪ፡ ማርያም ዉድስት ሰላም ለኪ፡
                ማርያም ፍሥሕት ሰላም ለኪ፡ አብደረኪ ወኅረየኪ ከመ ትኩኒዮ ማኅደሮ ሰላም ለኪ፡
                በአልባሰ ወርቅ ዑፅፍት ወኁብርት ሰላም ለኪ። ክንፈ ርግብ በቡሩር ዘግቡር ሰላም ለኪ፡
                ወገበዋቲሃኒ በሐመልማለ ወርቅ ማርያም ሥርጉት ሰላም ለኪ፡ ኆኅተ ምሥራቅ ወእሙ ለብርሃን ሰላም ለኪ፡
                ትበርሂ እምፀሓይ ወትትሌዐሊ እምአድባር ሰላም ለኪ፡ ማርያም ኅርት ወክብርት ሰላም ለኪ፡ ሰአሊ ለነ ኀበ እግዚእነ ወመድኃኒነ ኢየሱስ ክርስቶስ፡ ከመ
                ያድኅነነ እመ ይመጽእ በስብሐተ አቡሁ ምስለ መላእክቲሁ
                ቅዱሳን፡ እመ ያቀዉም አባግዐ በየማኑ ወአጣሌ በፀጋሙ፡
                ያቁመነ በየማኑ ምስለ እስጢፋኖስ ሰማዕት ወዮሓንስ
                መጥምቅ።ወምስለ ኩሎሙ ቅዱሳን ወሰማዕት ለዓለመ ዓለም
                አሜን።
                {'\n'}{'\n'}<Text style={styles.header} >ጸሎታ ለማርያም ወስእለታ ያድኅነነ እመዓተ
                ወልዳ፡ጸሎታ ለማርያም ወስእለታ ለርእሰ ሊቃነ ጳጳስነ
                እገሌ......ይዕቀቦ እመዓተ ወልዳ፡ ጸሎታ ለማርያም
                ወስእለታ ለመፍቀሬ አምላክ.......ይዕቀቦሙ እመዓተ
                ወልዳ፡ ጸሎታ ለማርያም ወስእለታ ለሕዝበ ክርስቲያን
                ይዕቀቦሙ እመዓተ ወልዳ፡ ጸሎታ ለማርያም ወስእለታ
                ለሀገሪትነ ኢትዮጵያ ይዕቀቦሙ እመዓተ ወልዳ።</Text>

            </Text>
    </ScrollView>
  )
}
const styles=StyleSheet.create({
    container: {
        // padding: 10,flex
        // marginLeft: 10,
        fontSize: 17, paddingTop: 6, paddingRight: 5, paddingBottom: 10, paddingLeft: 10,
      },
    header :{
        color: 'red', 
        fontSize: 18,
        alignItems: 'center', 
        marginTop: 20,
      }
});
export default ይወድስዋ_መላዕክት